[AdvCaptainM1 X2CharacterTemplate]
strCharacterName="ADVENT Captain"

[AdvCaptainM2 X2CharacterTemplate]
strCharacterName="ADVENT Major"

[AdvCaptainM3 X2CharacterTemplate]
strCharacterName="ADVENT Colonel"

[AdvShieldBearerM3 X2CharacterTemplate]
strCharacterName="Shieldbearer Elite"

[AdvStunLancerM3 X2CharacterTemplate]
strCharacterName="Stun Lancer Elite"

[AdvTrooperM3 X2CharacterTemplate]
strCharacterName="Trooper Elite"

[AdvGeneralM1 X2CharacterTemplate]
strCharacterName="Brigadier General"

[AdvGeneralM2 X2CharacterTemplate]
strCharacterName="Major General"

[AdvGeneralM3 X2CharacterTemplate]
strCharacterName="General Elite"

[SpectreM2 X2CharacterTemplate]
strCharacterName="Spectre Elite"

[AdvPurifierM3 X2CharacterTemplate]
strCharacterName="Purifier Elite"

[AdvPriestM1 X2CharacterTemplate]
strCharacterName="Elder's Deacon"

[AdvPriestM2 X2CharacterTemplate]
strCharacterName="Elder's Priest"

[AdvPriestM3 X2CharacterTemplate]
strCharacterName="Elder's Archbishop"

[AdvDroneM3 X2CharacterTemplate]
strCharacterName="Medi Drone Elite"
strAcquiredText="Recon Drones are small airborne support units that can stun at melee range and have a small laser weapon for skirmishes."

[AdvSkirmisherM1 X2CharacterTemplate]
strCharacterName="Skirmisher Captain"
strAcquiredText="These Skirmishers are elite followers of the Elders." 

[AdvSkirmisherM2 X2CharacterTemplate]
strCharacterName="Skirmisher Major"
strAcquiredText="These Skirmishers are elite followers of the Elders." 

[AdvSkirmisherM3 X2CharacterTemplate]
strCharacterName="Skirmisher Colonel"
strAcquiredText="These Skirmishers are elite followers of the Elders."

[AdvTrooperShoggothM3 X2CharacterTemplate]
strCharacterName="Trooper Elite"

[AdvTrooperHeavyM3 X2CharacterTemplate]
strCharacterName="Heavy Elite"
strAcquiredText="Heavy Troopers wear more advanced armor, offering better protection." 

[AdvTrooperShotgunM3 X2CharacterTemplate]
strCharacterName="Striker Elite"
strAcquiredText="With their Shotgun, the Striker Trooper can dish out a large amount of damage. They have increased mobility and will try to leverage this for flank shots."

[AdvTrooperGrenadeM3 X2CharacterTemplate]
strCharacterName="Demolitionist Elite"
strAcquiredText="The elite Demolitionist Trooper is equipped with a plasma grenade, a grenade launcher and a wrist mounted rocket launcher." 

[AdvTrooperEnviroM3 X2CharacterTemplate]
strCharacterName="Wrecker Elite"
strAcquiredText="The Wrecker Trooper is an anti-armor unit that is able to shred and pierce armor. They also have increased environmental damage."

[AdvTrooperCannonM3 X2CharacterTemplate]
strCharacterName="Gatling Sergeant Elite"
strAcquiredText="Armed with a minituarized version of the MEC Cannon, Gatling Troopers are able to unleash devastating bullet storms on enemies." 

strCharacterName="Sharpshooter Sergeant"
strAcquiredText="Armed with a sniper rifle, these unleash precision shots on their targets. Also carries a pistol. Uses Squadsight." 
[AdvTrooperSniperM3 X2CharacterTemplate]
strCharacterName="Sharpshooter Sergeant Elite"
strAcquiredText="Armed with a sniper rifle, these unleash precision shots on their targets. Also carries a pistol. Uses Squadsight." 

[AdvStunLancerShotgunM2 X2CharacterTemplate]
strCharacterName="Heavy Assault"
strAcquiredText="Outfitted with a Stun Lance and a Shotgun, Assault Lancers are the ultimate close quarters combat unit." 

[AdvStunLancerShotgunM3 X2CharacterTemplate]
strCharacterName="Assault Elite"
strAcquiredText="Outfitted with a Stun Lance and a Shotgun, Assault Lancers are the ultimate close quarters combat unit. This elite unit can fire multiple times per turn." 

[AdvSupportMEC_M1 X2CharacterTemplate]
strCharacterName="Anti-Riot MEC"
strAcquiredText="Anti Riot MECs can use smoke bombs to provide cover for their allies." 

[AdvSupportMEC_M2 X2CharacterTemplate]
strCharacterName="Heavy Anti-Riot MEC"
strAcquiredText="Anti Riot MECs can use smoke bombs to provide cover for their allies. This heavy MEC also comes with a launcher for cluster flashbangs that disorient in a large radius." 

[SectoidTrooperM4 X2CharacterTemplate]
strCharacterName="Sectoid Soldier Prime"
strAcquiredText="The Soldier Sectoid can only use Psi Reanimation, but his combat abilities are much improved. This unit is a Prime, which gives him the ability to react whenever he is hurt." 

[SectoidMindbenderM4 X2CharacterTemplate]
strCharacterName="Sectoid Mindbender Prime"
strAcquiredText="Mindbender Sectoids have above average psi capabilities. Their Mindspin is more likely to have better effects. Zombies risen by a Mindbender will live on without the Sectoid around. This unit is a Prime, which gives him the ability to react whenever he is hurt."
 
[SectoidPuppeteerM4 X2CharacterTemplate]
strCharacterName="Sectoid Puppeteer Prime"
strAcquiredText="A unique variant of the Sectoid, the Puppeteer can raise multiple zombies per turn. Puppets will live on even when the Puppeteer dies. This unit is a Prime, which gives him the ability to react whenever he is hurt." 

[AdventCustodianMaster X2CharacterTemplate]
strCharacterName="Custodian Elite"
strAcquiredText="Custodian Elites use a long range artillery weapon that bypasses armor"

[AdvGeneralM3B X2CharacterTemplate]
strCharacterName="Royal Sovereign Elite"

[AdvHonorGuardM3 X2CharacterTemplate]
strCharacterName="Honor Guard Elite"

[AdvHonorGuardLMGM3 X2CharacterTemplate]
strCharacterName="Honor Guard Elite"

[AdvRaptorM3 X2CharacterTemplate]
strCharacterName="Raptor Commando Elite"

[AdvWraithM3 X2CharacterTemplate]
strCharacterName="Wraith Commando Elite"

[AdvDestroyerM3 X2CharacterTemplate]
strCharacterName="Destroyer Commando Elite"

[PsiDroneM2 X2CharacterTemplate]
strCharacterName="Advanced Phase Drone"

[PsiDroneM3 X2CharacterTemplate]
strCharacterName="Phase Drone Elite"

[BerserkerOmega X2CharacterTemplate]
strCharacterName="Berserker Elite"
strAcquiredText="Berserker Elites are powerhouse beasts created to destroy anything in their patch. They have the ability to level large areas in a mater of seconds."

[AdvBioTrooperM3 X2CharacterTemplate]
strCharacterName="Bio Trooper Elite"

[AdvBioTrooperFakeM3 X2CharacterTemplate]
strCharacterName="Bio Trooper Elite"

[AdvBioCaptainM2 X2CharacterTemplate]
strCharacterName="Bio Major"

[AdvBioCaptainM3 X2CharacterTemplate]
strCharacterName="Bio Colonel"

[AdvBioGeneralM1A X2CharacterTemplate]
strCharacterName="Bio Brigadier General"

[AdvBioGeneralM2A X2CharacterTemplate]
strCharacterName="Bio Major General"

[AdvBioGeneralM3A X2CharacterTemplate]
strCharacterName="Bio General Elite"

[AdvBioGeneralM2B X2CharacterTemplate]
strCharacterName="Bio Major General"

[AdvBioGeneralM3B X2CharacterTemplate]
strCharacterName="Bio General Elite"

[AdvBioGeneralM1C X2CharacterTemplate]
strCharacterName="Bio Brigadier General"

[AdvBioGeneralM2C X2CharacterTemplate]
strCharacterName="Bio Major General"

[AdvBioGeneralM3C X2CharacterTemplate]
strCharacterName="Bio General Elite"

[AdvBioGeneralM2D X2CharacterTemplate]
strCharacterName="Bio Major General"

[AdvBioGeneralM3D X2CharacterTemplate]
strCharacterName="Bio General Elite"

[BioViperGold X2CharacterTemplate]
strCharacterName="Bio Viper Elite"

[BioFacelessM2 X2CharacterTemplate]
strCharacterName="Bio Faceless Elite"